title: Cowrie SSH Successful Login (High)
id: 1a2b3c4d-ssh-cowrie-success
status: experimental
description: Detects any successful SSH login to the Cowrie honeypot.
author: kanootsaeed
date: 2025/09/02
logsource:
  product: linux
  service: cowrie
detection:
  sel_success:
    eventid: cowrie.login.success
  condition: sel_success
fields:
  - timestamp
  - src_ip
  - username
falsepositives:
  - Lab testing / demos
level: high
tags:
  - attack.lateral_movement
  - attack.t1021
